import bigAdd from "./index"

test("如果一个数为空，应该返回另一个数", () => {
  expect(bigAdd("", "42")).toBe("42")
  expect(bigAdd("99", "")).toBe("99")
})

test("如果参数全部为空，应该返回0", () => {
  expect(bigAdd("", "")).toBe("0")
})

test("能够支持精度范围内的整数, 不带进位", () => {
  expect(bigAdd("42", "36")).toBe("78")
})

test("能够支持精度范围内的整数, 带进位", () => {
  expect(bigAdd("42", "99")).toBe("141")
})

test("能够支持精度范围内的整数, 位数不一致", () => {
  expect(bigAdd("42", "9")).toBe("51")
})

test("应该支持精度内和超精度的数相加", () => {
  expect(bigAdd("42", "99999999999999999999999999999")).toBe(
    "100000000000000000000000000041",
  )
  expect(bigAdd("99999999999999999999999999999", "42")).toBe(
    "100000000000000000000000000041",
  )
})

test("应该支持超精度的数相加", () => {
  expect(
    bigAdd("99999999999999999999999999999", "99999999999999999999999999999"),
  ).toBe("199999999999999999999999999998")
})
